app/controllers/attendances_controller.rb

    def index
        @attendances = current_user.attendances.where(attendance_date: start_date..end_date)
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."user_id" = ? AND "attendances"."attendance_date" BETWEEN ? AND ?  [["user_id", 1], ["attendance_date", "2023-07-01"], ["attendance_date", "2023-07-31"]]