app/controllers/sessions_controller.rb

UPDATE "users" SET "updated_at" = ?, "current_login_token" = ? WHERE "users"."id" = ?  [["updated_at", "2023-07-21 06:39:20.566636"], ["current_login_token", "[FILTERED]"], ["id", 1]]
---
    def set_login_token
      token = Devise.friendly_token
      session[:login_token] = token
      current_user.current_login_token = token
      current_user.save